Repository: IVNSTN/TeamTools.Linter.TSQL
Catalog: TeamTools.TSQL.Linter/Properties/Strings.*.resx
Languages: ru_ru

# ViolationDetails_RaisErrorOptionsRule_SetErrorIsOfNoUse
source: SETERROR - is of no use
ru_ru: SETERROR - излишее ручное управление

# ViolationDetails_RaisErrorOptionsRule_WithLogSpam
source: WITH LOG - stop spamming to the Server log
ru_ru: WITH LOG - не стоит спамить в серверный лог

# ViolationDetails_SimplePredicateNegationRule_UseReversedComparison
source: switch to '{0}' and remove NOT
ru_ru: замените сравнение на '{0}' без отрицания

# ViolationDetails_NativelyUnsupportedInstructionRule_LanguageMissing
source: LANGUAGE option required
ru_ru: нужно указать значение LANGUAGE

# ViolationDetails_NativelyUnsupportedInstructionRule_IsolationLevelMissing
source: ISOLATION LEVEL option required
ru_ru: нужно указать значение ISOLATION LEVEL

# ViolationDetails_NativelyUnsupportedInstructionRule_AtomicBeginMissing
source: ATOMIC block expected
ru_ru: нужен блок ATOMIC

# ViolationDetails_NativelyUnsupportedInstructionRule_BadIsolationLevel
source: unsupported isolation level {0}
ru_ru: уровень изоляции {0} не поддерживается

# ViolationDetails_DeprecatedSystemViewRule_UseOtherOption
source: use {0} instead
ru_ru: воспользуйтесь {0}

# ViolationDetails_BadLockEscalationForPartitionedTableRule_TableIsDefault
source: default is 'TABLE'
ru_ru: уровень 'TABLE' устанавливается по умолчанию

# ViolationDetails_SpExecuteParamDefinitionMatchRule_ParamCountMismatch
source: param count {1}!={0}
ru_ru: задекларировано {0}, а передаётся {1} параметров

# ViolationDetails_NativelyUnsupportedInstructionRule_TempProc
source: temp proc
ru_ru: временная хранимая процедура

# ViolationDetails_NativelyUnsupportedInstructionRule_NumberedProc
source: numbered proc
ru_ru: нумерованная хранимая процедура

# ViolationDetails_LiteralHasInvisibleCharRule_SymbolAtPos
source: {0} at {1}
ru_ru: {0} на позиции {1}

# ViolationDetails_TypeSynonymRule_ExpectedAnother
source: expected {0} but was {1}
ru_ru: вместо {1} пишите {0}

# ViolationDetails_InvalidTypeSizeRule_NotInteger
source: size/precision is not a valid integer value
ru_ru: указанный размер не является целым числом

# ViolationDetails_InvalidTypeSizeRule_OutOfRange
source: {3} size {0} is out of range {1}-{2}
ru_ru: "{3} размер {0} вне допустимого диапазона {1}-{2}"

# ViolationDetails_TriggerNamePatternRule_SchemaPrefix
source: unexpected schema prefix
ru_ru: излишний префикс со схемой

# ViolationDetails_TriggerNamePatternRule_HungarianPrefix
source: unexpected hungarian prefix
ru_ru: излишний префикс венгерской нотации

# ViolationDetails_TriggerNamePatternRule_TablePrefix
source: missing table name prefix
ru_ru: отсутствует префикс с именем таблицы

# ViolationDetails_TriggerNamePatternRule_LongSuffix
source: suffix is longer {0}
ru_ru: суффикс длинее {0}

# ViolationDetails_TriggerNamePatternRule_ShortSuffix
source: suffix is shorter {0}
ru_ru: суффикс короче {0}

# ViolationDetails_SparseColumnIndexFilterRule_ColInIndex
source: {0} in {1}
ru_ru: {0} в индексе {1}

# ViolationDetails_IdSuffixForIntegerTypesOnlyRule_ColIsOfType
source: {0} is of type {1}
ru_ru: {0} имеет тип {1}

# ViolationDetails_SparseUnsupportedFeatureRule_ColCannotHaveDefault
source: {0} cannot have DEFAULT
ru_ru: {0} не может иметь значение по умолчанию

# ViolationDetails_SparseUnsupportedFeatureRule_ColCannotBeIdentity
source: {0} cannot be IDENTITY
ru_ru: {0} не может быть IDENTITY

# ViolationDetails_SparseUnsupportedFeatureRule_ColCannotBeNotNullable
source: {0} must be NULLable
ru_ru: {0} должна допускать NULL

# ViolationDetails_SparseUnsupportedFeatureRule_ColCannotBeRowguidCol
source: {0} cannot be ROWGUIDCOL
ru_ru: {0} не может быть ROWGUIDCOL

# ViolationDetails_SparseUnsupportedFeatureRule_ColCannotBeFilestream
source: {0} cannot be FILESTREAM
ru_ru: {0} не может быть FILESTREAM

# ViolationDetails_SparseUnsupportedFeatureRule_ColCannotBeComputed
source: {0} cannot be computed
ru_ru: {0} не может быть вычисляемой

# ViolationDetails_SparseUnsupportedFeatureRule_TableCannotBeCompressed
source: table {0} cannot be compressed
ru_ru: таблица {0} не может быть сжатой

# ViolationDetails_SparseColumnsAsSecondaryRule_CountOutOfTotal
source: {0} out of total {1}
ru_ru: {0} из {1} всего

# ViolationDetails_CursorCommandOrderRule_NotDeallocated
source: Cursor '{0}' was not deallocated
ru_ru: Курсор '{0}' не был деаллоцирован

# ViolationDetails_DuplicateConditionRule_SeeDupAtLine
source: see another occurance at line {0}
ru_ru: дубль в строке {0}

# ViolationDetails_AmbiguousUniquenessRule_ColumnAlreadyIncluded
source: columns {0} already included into {1}
ru_ru: столбцы {0} уже включены в {1}

# ViolationDetails_BloatedClusteredIndexRule_TooManyCols
source: has {0} cols on {1}
ru_ru: {0} столбцов в индексе на {1}

# ViolationDetails_BloatedClusteredIndexRule_TooBig
source: estimated key size {0} is too big on {1} with {2} columns indexed
ru_ru: индекс на {1} из {2} столбцов оценивается в {0} байт на ключ

# ViolationDetails_RedundantNegationRule_InsteadUse
source: use {0} instead
ru_ru: замените на {0}

# ViolationDetails_InvalidTypeForNumericOperationRule_BadOp
source: {1} on {0} type
ru_ru: {1} с типом {0}

# ViolationDetails_VariableTypePrecisionLackRule_TypeIsNoGood
source: Argument {0} of type {1} is not good enough for {2}
ru_ru: тип {1} аргумента {0} не подходит для работы с {2}

# PluginMsg_FailedLoadingConfig
source: Failed loading config from
ru_ru: Не удалось загрузить конфигурацию плагина из

# ViolationDetails_RedundantNestedConditionRule_DupPos
source: same seen at line {0}
ru_ru: такое же есть в строке {0}

# ViolationDetails_CursorCommandOrderRule_RedeclaringNotDeallocated
source: Redeclaring never deallocated cursor '{0}'
ru_ru: переопределение курсора '{0}', который не был деаллоцирован

# ViolationDetails_CursorCommandOrderRule_OpeningNotDeclared
source: Opening not declared or already opened cursor '{0}'
ru_ru: курсор '{0}' не объявлен или уже открыт

# ViolationDetails_CursorCommandOrderRule_FetchingFromNotOpened
source: Fetching from not opened cursor '{0}'
ru_ru: чтение из курсора '{0}', который не был открыт

# ViolationDetails_CursorCommandOrderRule_ClosingNeverFetched
source: Closing cursor '{0}' that was never used for fetching
ru_ru: закрытие курсора '{0}' без чтения из него

# ViolationDetails_CursorCommandOrderRule_DeallocatingUnclosed
source: Deallocating unclosed '{0}' cursor
ru_ru: деаллоцирование курсора '{0}', который не был закрыт

# PluginMsg_UnknownCompatibilityLevel
source: Unknown compatibility level: {0}
ru_ru: Неизвестный уровень совместимости: {0}

# PluginMsg_ConfigAlreadyLoaded
source: Config already loaded
ru_ru: Конфигурация уже загружена

# ViolationDetails_TableKeyValidation_ColHasBadType
source: {0} is {1}
ru_ru: {0} имеет тип {1}

# ViolationDetails_PartitionSchemeHardcoded_UseAllToPrimary
source: Use
ru_ru: Используйте

# ViolationDetails_RedundantGrantRule_AlreadyGrantedToSchema
source: {0} already given on schema {1}
ru_ru: разрешение {0} выдано на всю схему {1}

# ViolationDetails_RedundantGrantRule_AlreadyGranted
source: {0} already granted
ru_ru: разрешение {0} уже выдано

# ViolationDetails_ReturnValueTypeMismatchRule_UnexpectedReturnValueType
source: expected {0} but was {1}
ru_ru: вместо {0} возвращается {1}
